# Найдите сумму цифр трехзначного числа.

# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

num = int(input('Введите трёхзначное число: '))
sum = 0
if 99 < num <= 999:

    result = num % 10
    sum = sum + result
    n = num//10
    n = n % 10
    m = num//10
    m = m//10
    print(sum + n + m)
else:
    print('число не трёхзначное')